Repository: loginom/loginom-help-en-omegat
Catalog: omegat/project_save.tmx
Source language: ru
Languages: en

source: Позволяет настроить формат отображения фактов и заголовков измерений в Кубе, выбрав нужный факт или заголовок в соответствующей вкладке в верхнем левом углу окна Форматирование (Рис.
en: It enables to set the format of display of measures and captions of dimensions in the Cube by selecting the required measure or caption in the corresponding tab in the upper left corner of the Formatting window (Figure

source: Позволяет представить данные для пользователя в виде плоской двумерной таблицы с возможностью фильтрации, сортировки, изменения формата отображения данных и поиска.
en: It enables to display the data for users in the form of the flat two-dimensional table with possibility of filtering, sorting, changing of data view format and search.

source: Поиск можно настроить, нажав кнопку Раскрыть.
en: It is possible to configure search by pressing Open button.

source: Поиск учетной записи по введенному имени в каталоге Базовый домен (и его подкаталогах) соответствующего Фильтру LDAP;
en: Search for the account by the entered name in the Base Domain directory (and its subdirectories) matching the LDAP Filter.

source: Поиск ячеек в таблице по значению.
en: Search for cells in table by value.

source: Пока что настройка процессов, задание измерений, атрибутов и фактов может осуществляться с помощью редактора метаданных, встроенного в Deductor Studio.
en: So, configuration of processes, setting of dimensions, attributes and measures can be performed by means of the metadata editor built into Deductor Studio.

source: Показывать сетку — отобразить/скрыть вертикальные линии сетки на диаграмме.
en: Show grid: show/hide the vertical lines of the chart grid.

source: Показывать сетку — отобразить/скрыть горизонтальные линии сетки на диаграмме.
en: Show grid: show/hide the horizontal lines of the chart grid.

source: Пол покупателя
en: Sex of consumer

source: Поле (переменная) входного набора порта
en: Field (variable) of the input port data set

source: Поле (переменная) выходного набора порта
en: Field (variable) of the output port data set

source: Поле Значение таблицы замен содержит значения, подлежащие замене.
en: The Value field of the replacement table contains the values to be replaced.

source: Поле X — задается поле для оси X.
en: X field: the field is set for X axis.

source: Поле Y — задается поле для оси Y.
en: Y field: the field is set for Y axis.

source: Поле будет запрещено к использованию, если:
en: The field will be no longer permitted for use in the following cases:

source: Поле выходных данных|Прогноз.
en: Output data field|Prediction.

source: Поле имеет также возможность ввода фильтра для поиска определенного пользователя.
en: It is also possible to include the filter for search for a particular user into this field.

source: Поле меток — поле для задания обозначений делений оси X.
en: Caption field: the field used to set the X axis points marks.

source: Поле присутствует, если установлен флаг Рассчитать доверительный интервал.
en: The field is available if the following checkbox is selected: Calculate confidence interval.

source: Поле присутствует, если установлен флаг Рассчитать ошибку аппроксимации.
en: The field is available if the following checkbox is selected: Calculate the approximation error.

source: Поле содержит данные даты и времени.
en: The field contains the date and time data.

source: Поле, значениями которого является произвольная последовательность символов (строка).
en: The field which values are represented by the random sequence of characters (string).

source: Поле, соответствующее временному ряду, должно иметь назначение Прогнозируемое, тип данных Вещественный и вид данных Непрерывный.
en: The field mapping the time series must relate to the Forecast usage type, Real data type and Continuous data kind.

source: Полная поддержка этого формата есть в аналитической платформе Deductor.
en: This format is fully supported by the Deductor analytical platform.

source: Полное имя пользователя используется для уточнения владельца аккаунта в списке Пользователей.
en: The full username is used to specify the account owner in the Users list.

source: Полное соединение (SQL-аналог: FULL JOIN)
en: Full Join (SQL Analogue: FULL JOIN)

source: Получать данные от узлов из других сценариев и пакетов через механизм Узел-ссылка.
en: It can receive data from nodes from other workflows and packages using the Reference Node mechanism.

source: Получившиеся значения отображаются на пересечении колонок и строк.
en: The obtained values are displayed at the intersection of columns and strings.

source: Пользователи-аналитики выводят необходимые визуализаторы на «Панель отчетов», где могут размещаться как отдельные предварительно настроенные визуализаторы, так и папки с целыми группами визуализаторов.
en: The users-analysts place the required visualizers to the "Reports panel" where both separate preconfigured visualizers and folders with whole groups of visualizers can be placed.

source: Пользователь должен иметь в виду данное обстоятельство при принятии решения о преобразовании типа данных.
en: A user must consider this fact when taking decision on transformation of the data type.

source: Пользователь имеет возможность задать перечень и значения переменных пользователя, при этом область их применения ограничена Подмоделью.
en: A user can set a list and values of the user variables. In this case, the area of their usage will be restricted by the Supernode.

source: Пользователь с ролью «Проектирование сценариев» получает доступ ко всем аналитическим возможностям Loginom.
en: The user with "Workflows design" role is provided with access to all analytical capabilities of Loginom.

source: Пользователь с ролью «Просмотр отчетов» имеет доступ только к узлу с настроенными отчетами.
en: The user with "View reports" role is provided with access only to the node with configured reports.

source: Поля
en: Fields

source: Поля Код клиента и Месяц выберем как Информационные Информационные.
en: Client code and Month fields will be selected as Info Info.

source: Поля без сопоставления дополняют набор данных.
en: The fields without mapping append the data set.

source: Поля в данной группе обязательно должны иметь дискретный вид данных
en: The fields included into this group must relate to the discrete data kind.

source: Поля входного набора, которые будут использоваться в качестве входных или выходных, не должны содержать пропущенные значения.
en: The input data set fields that will be used as the input or output ones, must not contain null values.

source: Поля исходного набора данных, в ячейках которых рассчитано среднее значение параметров.
en: The source data set fields in the cells of which the average value of parameters has been calculated.

source: Поля исходного набора данных, для которых значение параметра Назначение выбрано Используемое.
en: The source data set fields for which Used was selected as Usage type parameter value.

source: Поля можно перемещать относительно друг друга, а также перемещать их из зоны закрепленных полей к незакрепленным и наоборот.
en: It is possible to move the fields relative to each other, and it is also possible to move them from the zone of frozen fields to the unfrozen ones and vice versa.

source: Поля с Назначением Не задано или Непригодное публикуются как необязательные (в WSDL SOAP-сервиса имеют атрибут minOccurs="0", а в схеме запроса REST-сервиса не входят в состав required-узлов).
en: The fields with Unspecifiedor Useless Usage type are published as optional (they have minOccurs="0" attribute in WSDL of SOAP service, they are not included into required nodes in the request schema of REST service).

source: Поля с другими значениями параметра являются обязательными в запросе.
en: The fields with other parameter values are required in the request.

source: Поля с непрерывным видом данных непригодны для обработки.
en: The fields with the continuous data kind are not suitable for processing.

source: Поля связываются при помощи перетаскивания мыши (Drag-and-drop).
en: The fields are linked using the Drag-and-Drop method.

source: Поля таблицы с указанием следующих параметров:
en: Table fields specifying the following parameters:

source: Поля таблицы, которые уже соотнесены с каким-либо элементом, подсвечиваются жирным шрифтом.
en: The table fields that are mapped to any item are marked in bold text.

source: Поля, назначение которого — "Транзакция".
en: The field with the "Transaction" usage type.

source: Поля, наличие которых задается пользователем:
en: There are the following fields the availability of which is set by a user:

source: Поля, определяющие страты, задаются в параметрах метода с помощью флажков.
en: The strata defining fields are set in the method parameters by means of checkboxes.

source: Поля, ряды которых требуется сгладить, следует отметить флагами, после этого в столбце "метод обработки" для каждого выбранного поля можно задать метод сглаживания:
en: It is required to provide checkboxes for the fields series of which are to be smoothed. Then it is possible to set the smoothing method in the "processing method" column for each selected field:

source: Поля, соответствующие дополнительным факторам, должны иметь назначение Входное.
en: The fields mapping the exogenous factors must relate to the Input usage type.

source: Поля/переменные
en: Fields/Variables

source: Полям главной таблицы необходимо сопоставить поля присоединяемой таблицы.
en: It is required to map the fields of the main and joined tables.

source: Пометить выделенный узел можно нажав клавишу Enter, повторное нажание Enter снимает выделение.
en: It is possible to check the selected node by pressing Enter. Pressing Enter repeatedly allows for deselection.

source: Помидоры
en: Tomatoes

source: Помимо автоматического, возможно связывание полей и объектов XML вручную двумя способами.
en: Apart from the automatic mode, it is possible to link fields and XML objects manually in two ways.

source: Помимо автоматической связи, входные и выходные узлы можно связывать вручную с помощью метода Drag-and-drop путем перетаскивания метки поля из левого списка полей на элемент из правого списка полей.
en: Apart from the auto link, it is possible to link input and output nodes using the Drag-and-drop method by dragging the field caption from the left list of fields to the item from the right list of fields.

source: Помимо выполнения Сценариев в интерфейсе (Интерактивный режим), существует другой вариант исполнения — пакетный режим.
en: Apart from the Workflows execution in the interface (Interactive mode), there is another execution option — batch mode.

source: Помимо кнопок Панели инструментов, в контекстном меню присутствует пункт Скрыть единственный факт, который позволяет скрыть заголовки фактов, если активен единственный факт.
en: Apart from the Toolbar buttons, there is Hide single measure option in the context menu. It enables to hide headers of measures if the only measure is active.

source: Помимо настроек диапазонов есть флажок:
en: Apart from the range settings, the checkbox is also available:

source: Помимо обычных форматов даты есть возможность установить формат, соответствующий международному стандарту даты ISO 8601.
en: Apart from the standard date formats, it is possible to set the format that complies with the international date standard - ISO 8601.

source: Пониженная точность.
en: Reduced accuracy.

source: Порог значимости при добавлении фактора.
en: Significance threshold in the case of factor addition.

source: Порог значимости
en: Significance Threshold

source: Порог значимости при исключении фактора.
en: Significance threshold in the case of factor exception.

source: Порог минимального изменения весов - если на очередном шаге обучения относительное изменение нормы вектора весов становится меньше порога, то обучение останавливается.
en: Minimum weight change threshold: if the relative change of the weights vector norm is less than the threshold at another training step, the training stops.

source: Порог минимального изменения весов — если на очередном шаге обучения относительное изменение нормы вектора весов становится меньше порога, то обучение останавливается.
en: Minimum weight change threshold: if the relative change of the weights vector norm is less than the threshold at another training step, the training stops.

source: Порог отсечения
en: Cutoff

source: Порог отсечения при обучении модели
en: Model train cutoff

source: Порог разделения кластеров (в интервале от 0,1 до 5).
en: Cluster splitting significance threshold (in the interval from 0.1 to 5).

source: Порт
en: Port

source: Порт порядка выполнения
en: Execution order port

source: Порт порядка выполнения предназначен для ручного определения последовательности выполнения узлов Сценария.
en: The execution order port is designated for the manul determination of the Workflow nodes execution order.

source: Порт связи наследования
en: Port of heritage connection

source: Порт связи наследования (см.
en: Port of heritage connection (refer to

source: Порт связи ссылки
en: Port of reference connection

source: Порт связи ссылки (см.
en: Port of reference connection (refer to

source: Порт управляющих переменных принимает переменные, с помощью которых можно задать параметры настроек узлов.
en: The control variables port accepts the variables that enable to set parameters of the node settings.

source: Порт, по которому происходит обращение к серверу Loginom.
en: The port used for access to the Loginom server.

source: Порты могут быть следующих типов:
en: There are the following types of ports:

source: Порты с сплошной линией являются обязательными портами, т.е. для их работы необходима связь с другими портами.
en: Ports with сплошной линией are required ports, namely, connection with other ports is required for their operation.

source: Порты, взаимодействующие с наборами переменных, графически отображаются так:
en: The ports interacting with the sets of variables are graphically displayed as follows:

source: Порядковый номер интервала
en: Index bin number

source: Порядок - необязательный параметр, позицию какого по счету вхождения Подстроки в Строку возвращать.
en: MatchIndex - optional occurrence index of the Substring in the String to be returned.

source: Порядок вейвлета - определяет гладкость восстановленного ряда данных: чем меньше значение параметра, тем сильнее будут выражены «выбросы», и, наоборот, при больших значения параметра «выбросы» будут сглажены.
en: Wavelet order defines the smoothness of the recovered data series: the lower the parameter value, the more expressed "outliers" are observed, and vice versa, the "outliers" will be smoothed when the parameter values are high.

source: Порядок множеств можно менять (кнопки Сдвинуть вверх, Сдвинуть вниз).
en: It is posssible to change the order of sets (Move up, Move down buttons).

source: Порядок может быть как положительным, так и отрицательным.
en: The MatchIndex can be both positive and negative.

source: Порядок полей в данной группе влияет на порядок сортировки данных в результирующей таблице по этим полям.
en: The fields order in this group has an impact on data sorting in the resulting table by these fields.

source: Порядок столбцов можно менять перетаскиванием, удерживая левую кнопку мыши на заголовке перемещаемого столбца.
en: Order of columns can be changed by dragging holding down the left mouse button on the header of the moved column .

source: Поскольку в Калькуляторе для каждой из вычисляемых ячеек таблицы происходит выполнение скрипта, то содержащийся в нем вызов require модуля происходит многократно и используется кэш.
en: As the script is executed in Calculator for each of the calculated table cells, the includedrequire module is repeatedly called, and cache is used.

source: Поскольку в Подмодели можно реализовать произвольную логику обработки данных и задать необходимые входные и выходные порты, то на ее основе пользователь имеет возможность создать Производный компонент с универсальной функциональностью, пригодной для многократного использования в различных аналитических задачах.
en: As it is possible to use the random logics of data processing in the Supernode and set the required input and output ports, a user has an opportunity to create the Derived Component with the universal feature on its basis. It will be suitable for multiple use in different analytical tasks.

source: Поскольку в этот столбец могут перемещаться данные разных типов, то для них используется тип данных Переменный Переменный.
en: As the data of different types can be moved to this column, Variable Variable data type is used for them.

source: Поскольку вспомогательные данные чаще представляются в источниках данных как дополнительные атрибуты транзакций, обработчик имеет отдельный вход для их приема.
en: As the supplementary data is more frequently represented in the data sources as additional transaction attributes, the handler has a separate input to receive it.

source: Поскольку мутации используются при выполнении операции экспорта с удалением по ключу, то факт активации узла экспорта не гарантирует завершение процесса удаления записей.
en: As mutations are used during the export operation with deletion by key, the export node activation does not provide termination of the records deletion process.

source: Поскольку первый порт присутствует в узле JavaScript по умолчанию, для доступа к его данным существует отдельный объект InputTable.
en: As the first port is in the JavaScript node by default, there is a separate InputTable object to provide access to its data.

source: Поскольку таблицы и переменные имеют разную структуру, то соответствующие им порты не могут быть соединены друг с другом и имеют разное обозначение.
en: As tables and variables have different structure, the ports corresponding to them cannot be connected with each other, and they are differently identified.

source: Поскольку таблицы, переменные и подключения имеют разную структуру, то соответствующие им порты не могут быть соединены друг с другом и имеют разное обозначение.
en: As tables, variables and connections have different structure, the ports corresponding to them cannot be connected with each other, and they are differently identified.

source: После авторизации Loginom кликнуть на иконку Меню в левом верхнем углу и после этого кликнуть на пункт меню "О программе".
en: It is required to click the Menu icon in the left upper corner after Loginom authorization, and then you are to click on "About".

source: После авторизации открывается окно выбора действий (страница Начало), в котором можно выполнять следующие операции с пакетами.
en: Upon authorization, the action selection window will be opened (the Home page page). Using this window you can perform the following operations with packages.

source: После выбора всех настроек нажать кнопку Сортировать для применения сортировки в таблице.
en: When all settings are selected, it is required to press Sort to enable sorting in the table.

source: После выбора всех настроек необходимо нажать кнопку Применить для применения форматов отображения.
en: After selection of all settings, it is required to press Apply button to apply the display formats.

source: После выбора пакета пользователь попадает в рабочее пространство программы.
en: Upon package selection, a user will enter the working space of the software.

source: После добавления в узел визуализатора откроется главное окно (Рис.
en: The main window will be opened after addition to the visualizer node (Figure

source: После завершения работы со списком следует нажать кнопку Применить для внесения изменений либо Отменить для возврата к состоянию до начала работы со списком.
en: When the work with the list is completed, it is required to press Apply button to introduce changes, or Cancel button to return to the state before the work with the list.

source: После задания параметров в мастере настройки узел цикла имеет набор портов узла, заключенного в цикл, кроме выходных портов для переменных.
en: Upon configuration of parameters in the wizard, the loop node has a set of ports of the looped node, apart from the output ports for variables.

source: После закрытия пакета этот файл удаляется.
en: This file is deleted upon the package closure.

source: После заполнения всех полей необходимо нажать кнопку Загрузить и XSD схема будет загружена для дальнейшей работы.
en: After filling in all the fields, it is required to press Load button, and the XSD schema will be loaded for further work.

source: После запуска Loginom кликнуть на иконку Меню в левом верхнем углу и после этого кликнуть на пункт меню "О программе".
en: It is required to click on the Menu icon in the left upper corner upon Loginom start, and then you are to click the "About" menu option.

source: После нажатия на кнопку Рассчитать пересчитываются показатели в соответствии с выбранным количеством классов.
en: Upon pressing Calculate button, the parameters are recalculated according to the selected count of classes.

source: После настройки и выполнения узла группировки в выходном порту содержатся данные об итоговых суммах покупок клиентов.
en: Upon configuration and execution of the grouping node, data about total sums of the clients' purchases are in the output port.

source: После настройки параметров выражения в область кода требуется ввести рассчитываемую формулу.
en: After configuration of the expression parameters, it is required to enter the calculated formula to the code area.

source: После настройки узел имеет порты, идентичные портам базового узла.
en: Upon configuration, the node has the ports identical to ports of the base node.

source: После настройки узла выполним его, используя меню возможных действий.
en: Execute the node upon its configuration using the menu of possible actions.

source: После настройки узла отображаются выходные порты узла-источника данных.
en: Upon the node configuration, the output ports of the data source node are displayed.

source: После обработки значения поля Товар перешли в заголовки новых столбцов, значения поля Дата остались в строках, а значения поля Количество продаж просуммированы по датам.
en: Upon processing, the values of the Goods field were transferred to headers of the new columns, the values of the Date field were left in the strings, the values of the Volume of sales field were summed by dates.

source: После открытия приложения, в случае настольной версии Loginom, или авторизации, в случае серверной версии Loginom, появляется страница «Начало» (см.
en: Upon the application opening, in the case of the desktop Loginom edition, or authorization, in the case of the server Loginom edition, the "Home" page is opened (refer to

source: После создания Ссылки на внешний Пакет можно использовать созданные в нем Производные компоненты и обратиться к его объектам при помощи узлов Узел-ссылка, Выполнение узла.
en: Upon creation of the Reference to the external Package, it is possible to use the Derived Components created in it and refer to its objects using Reference node, Node execution nodes.

source: После создания Ссылки на внешний Пакет можно:
en: It is possible to perform the following actions upon creation of the Reference to the external Package:

source: После создания или открытия пакета на cтранице «Начало» появится главное рабочее окно программы, состоящее из четырех основных блоков (см.
en: Upon creation or opening of the package on the "Home" page, the main work application window that consists of four main blocks will appear (refer to
